#include <stdio.h>

int main() {
	char a = 1, b = 0, c = 0, x, y, z, k, l, m;
		
		x = a || b && !c;
		y = !a && !b;
		z = !(a && c) || b;
		k = a && !b || c;
		l = a && (!b || c);
		m = a && (!(b || c));
		
  	printf("Значение логического выражения 1 = %d\n", x);
  	printf("Значение логического выражения 2 = %d\n", y);
  	printf("Значение логического выражения 3 = %d\n\n", z);
   printf("Значение логического выражения 4 = %d\n", k);
   printf("Значение логического выражения 5 = %d\n", l);
   printf("Значение логического выражения 6 = %d\n", m);
	}
