#include <stdio.h>

int main() {
float x = 3, y = 1.5;
int a, b, c;
	a = x > 2 && y > 3;
	b = x > 2 || y > 3;
	c = x > 1 || y > - 2;
printf("\033cТочка A с координатами x = %f см и y = %f см \nx > 2 && y > 3\n", x, y);
printf("0 - Не принадлежит, 1 - Принадлежит Области из задачки\nA = %d \n\n", a);

printf("\nТочка B с координатами x = %f см и y = %f см \nx > 2 || y > 3;\n", x, y);
printf("0 - Не принадлежит, 1 - Принадлежит Области из задачки\nB = %d\n", b);

printf("\nТочка C с координатами x = %f см и y = %f см \nx > 1 || y > - 2;\n", x, y);
printf("0 - Не принадлежит, 1 - Принадлежит Области из задачки\nC = %d\n", c);
	}
